ext_alsav/InformationRegisters/алсав_СоставИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоставИзделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУзле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьВСборкеНоменклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_ИсторияПроведенияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_ИсторияПроведенияДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/CommonModules/Б_ОбменССайтомСервер/Ext/Module.bsl
&После("ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаССайтами")
Процедура алсав_ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаССайтами(Источник, Отказ)
	// Вставить содержимое метода.
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыКомплектацииНоменклатуры") Тогда		
		УстановитьПривилегированныйРежим(Истина);
		
		
		//Попытка
		//	Справочники.ВариантыКомплектацииНоменклатуры.ОбновитьСоставИзделия(Источник.Ссылка);
		//Исключение
		//КонецПопытки;
			
		
		РегистрыСведений.алсав_СоставИзделий.ОбновитьСостав(Источник.Владелец, Источник.Характеристика);
		РегистрыСведений.алсав_ПроверкаВнешнихФайлов.ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры", "Файл сметы", Источник.Ссылка);
		РегистрыСведений.алсав_ПроверкаВнешнихФайлов.ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры", "Файл модели", Источник.Ссылка);
		
		Справочники.Номенклатура.ОбновитьИмеетВариантКомплектации(Источник.Владелец);		
		Справочники.Номенклатура.ОбновитьИмеетВариантКомплектацииМатериалы(Источник.Владелец);
		
		Если (НЕ Источник.Характеристика = неопределено) И (ЗначениеЗаполнено(Источник.Характеристика)) Тогда
			Справочники.ХарактеристикиНоменклатуры.ОбновитьИмеетВариантКомплектации(Источник.Характеристика);		
			Справочники.ХарактеристикиНоменклатуры.ОбновитьИмеетВариантКомплектацииМатериалы(Источник.Характеристика);
		КонецЕсли;
		
	КонецЕсли;     
	
	
	ОтразитьИсторияПроведенияДокументов(Источник)
КонецПроцедуры

Процедура ОтразитьИсторияПроведенияДокументов(Источник)
	мТипы = Новый массив;
	мТипы.Добавить(Тип("ДокументОбъект.РеализацияТоваровУслуг"));
	мТипы.Добавить(Тип("ДокументОбъект.КорректировкаРеализации"));
	мТипы.Добавить(Тип("ДокументОбъект.ВозвратТоваровОтКлиента")); 
	
	Если мТипы.Найти(ТипЗнч(Источник)) <> неопределено Тогда
		МенеджерЗаписи  = РегистрыСведений.алсав_ИсторияПроведенияДокументов.СоздатьМенеджерЗаписи();
		
		Попытка
			МенеджерЗаписиЗаказКлиента = Источник.ЗаказКлиента;
		Исключение
		КонецПопытки;
		
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Документ = Источник.Ссылка;
		
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		
		МенеджерЗаписи.Записать(истина);
	КонецЕсли;
Конецпроцедуры
